#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 11478                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: gattswet0926 <boj.kr/u/gattswet0926>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/11478                          #+#        #+#      #+#     #
#    Solved: 2025/06/26 18:36:51 by gattswet0926  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

# 주어진 입력받기
S = input()

# 집합으로 중복 제거
partial_S = set()

# 길이 1부터 문자열 길이까지
for i in range(1, len(S) + 1):
    # 0번째부터 부분 문자열 길이를 제외한 인덱스까지
    for j in range(len(S) - i + 1):
        partial_S.add(S[j:j+i])

# 서로 다른 부분 문자열 개수 출력
print(len(partial_S))