#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2720                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: gattswet0926 <boj.kr/u/gattswet0926>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2720                           #+#        #+#      #+#     #
#    Solved: 2025/04/23 09:31:03 by gattswet0926  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

# 주어진 입력 받기
num_testcase = int(input())

for _ in range(num_testcase):
    # 거스름돈(단위: 센트)
    money = int(input())

    # 각 동전 갯수 저장 리스트
    coins = []

    # 쿼터, 다임, 니켈, 페니 순
    for div in [25, 10, 5, 1]:
        # 단위가 큰 동전부터 몇 개 필요한지 계산
        coins.append(money // div)
        # 이후 나머지를 그 다음 계산으로 넘김
        money %= div

    print(*coins)