#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 2745                              :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: gattswet0926 <boj.kr/u/gattswet0926>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/2745                           #+#        #+#      #+#     #
#    Solved: 2025/04/22 09:31:51 by gattswet0926  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #


# v2
# 파이썬 내장함수 사용

# 주어진 입력받기
n, b = input().split()

# int(value, base)
# default: value = 0, base = 10
# range: 2<= base < 36
print(int(n, int(b)))


#  **************************************************************************  #

# v1
# 변환테이블을 통해 진법 변환

# 주어진 입력받기
n, b = input().split()
b = int(b)

# 변환테이블
trans_table = {"0" : 0,
               "1" : 1,
               "2" : 2,
               "3" : 3,
               "4" : 4,
               "5" : 5,
               "6" : 6,
               "7" : 7,
               "8" : 8,
               "9" : 9,
               "A" : 10,
               "B" : 11,
               "C" : 12,
               "D" : 13,
               "E" : 14,
               "F" : 15,
               "G" : 16,
               "H" : 17,
               "I" : 18,
               "J" : 19,
               "K" : 20,
               "L" : 21,
               "M" : 22,
               "N" : 23,
               "O" : 24,
               "P" : 25,
               "Q" : 26,
               "R" : 27,
               "S" : 28,
               "T" : 29,
               "U" : 30,
               "V" : 31,
               "W" : 32,
               "X" : 33,
               "Y" : 34,
               "Z" : 35}

# 진법 계산
total = 0
for i, string_num in enumerate(n):
    num = trans_table[string_num]
    total += num * (b**(len(num) - i - 1))

# 출력
print(total)