#  **************************************************************************  #
#                                                                              #
#                                                       :::    :::    :::      #
#    Problem Number: 20115                             :+:    :+:      :+:     #
#                                                     +:+    +:+        +:+    #
#    By: gattswet0926 <boj.kr/u/gattswet0926>        +#+    +#+          +#+   #
#                                                   +#+      +#+        +#+    #
#    https://boj.kr/20115                          #+#        #+#      #+#     #
#    Solved: 2025/07/16 17:13:23 by gattswet0926  ###          ###   ##.kr     #
#                                                                              #
#  **************************************************************************  #

# 주어진 입력받기
N = int(input())
drinks = list(map(int, input().split()))

print((sum(drinks) - max(drinks)) / 2 + max(drinks))